[
  {
    "profile": "img/profile1.png",
    "feedback": "“Amoha.ai is the trailblazing revolution eye care has been waiting for, allowing ophthalmologists to screen and identify eye problems using artificial intelligence and with not just accuracy but also through remote locations using portable diagnostics. This will help catch many illnesses in their early stages, improve visual outcomes, and be a boon in our country, where there is a dearth of healthcare delivery systems in the interior.”",
    "name": "Dr. (Major) Prashant Kumar Singh Chauhan",
    "country": "Indian Army Veteran & Founder, Purple Squirrel Strategist"
  },
  {
    "profile": "img/profile3.png",
    "feedback": "“I've had the opportunity to review Amoha.ai, and I am genuinely impressed with the platform's capabilities. The accuracy in predicting diabetic retinopathy & macular edema is promising, and the user interface is intuitive, making it user-friendly for ophthalmologists. Amoha.ai has the potential to significantly impact the field of ophthalmology, not only in predicting DR and macular edema but also in its future applications. The initiative's commitment to affordability and accessibility is commendable, and I believe it could indeed revolutionize eye healthcare.”",
    "name": "Dr. Blessy Jacob",
    "country": "Ophthalmologist"
  },
  {
    "profile": "img/profile2.png",
    "feedback": "“Having reviewed Amoha.ai, I am pleased to express my endorsement for this groundbreaking initiative. The accuracy in predicting diabetic retinopathy & macular edema is promising, and the user interface is impressive. I see immense potential for Amoha.ai to expand beyond a few ocular conditions. Exploring collaborations with eye hospitals and incorporating feedback from experienced specialists will be crucial for the platform's growth. I envision Amoha.ai as a transformative force in predictive eye healthcare.”",
    "name": "Mr. Braj Bhushan Bijoria,",
    "country": "Co-founder, Purple Squirrel Strategist"
  }
]
